josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto.ino
/**
 * scanner-relay-prod-12v-robusto.ino — Producción QR + Relé 12V (variante ROBUSTA
 * definitiva). Basado en scanner-relay-prod-12v-no-bootclick.ino + 2 mejoras:
 *   A) relayOff() como PRIMERA línea de setup(): el relé queda cortado desde el
 *      instante en que corre el sketch (antes había ~3 s sin control por el
 *      delay(3000), que con la cerradura conectada disparaba el solenoide en el
 *      arranque → brownout → bucle de reinicios sin llegar al AP/heartbeat).
 *   B) Provisioning a prueba de fallos: si la WiFi guardada NO conecta, se abre
 *      SIEMPRE el portal (antes: "portal bloqueado" sin AP → placa invisible).
 *      Con el auto-wipe por fingerprint (reflash → pierde WiFi → AP por defecto)
 *      y el fallback del portal, la placa nunca queda inaccesible.
 * Hereda de no-bootclick:
 *   1) wifiConnectedFeedback() ya NO hace relayClick() al conectar WiFi.
 *   2) Las lecturas QR RECHAZADAS ya NO hacen relayClick().
 * El relé solo se acciona por apertura real (relayPulse) o verificación manual
 * (checkLock). Resto idéntico (WiFi NVS, WiFiManager, heartbeat 30 s, F33
 * command-queue, announce F40, watchdog, factory reset por GPIO4).
 *
 * RELÉ (configurable con RELAY_ACTIVE_LOW): por defecto ACTIVE-LOW tri-state para
 * el relé recuperado SONGLE SRD-12VDC-SL-C (LOW = ON, reposo FLOAT/INPUT). El
 * módulo ACTIVE-HIGH original se soporta poniendo RELAY_ACTIVE_LOW a 0.
 *
 * WiFi:
 *   - Credenciales WiFi guardadas en NVS (Preferences).
 *   - Cada build nuevo (MD5 + __DATE__ + __TIME__) borra solo las claves WiFi
 *     del namespace cerraduras y fuerza provisioning fresco; no borra device-cred.
 *   - Al arrancar: intenta conectar con credenciales NVS.
 *   - Si no hay credenciales/NVS o falla conexión: WiFiManager (portal cautivo).
 *   - El portal vuelve a abrirse solo manteniendo GPIO4 pulsado durante el arranque.
 *   - AP mode: "Cerraduras-Setup-<chipId>" (MAC de 12 chars, único por dispositivo).
 *   - Al conectar: LED 4.5s (SIN clic de relé) + blink-light API (luz habitación).
 *   - Credencial individual generada una vez y almacenada en NVS separado.
 *
 * BUILD/UPLOAD: recompilar y cargar este sketch en cada provisioning fresco.
 * No editar un marcador manualmente ni cargar el mismo binario: el digest del
 * sketch y __DATE__/__TIME__ forman el marcador automáticamente.
 *
 * Flujo normal:
 *   1. Lee QR vía USB-Host (EspUsbHost) — no consume GPIO16/17.
 *   2. Conecta a WiFi y hace POST /api/v1/qr/validate con device_id=chipId.
 *   3. Si HTTP 200 → activa relé GPIO16 durante OPEN_DURATION_MS (def. 3s).
 *   4. Si HTTP ≠200 → no acciona el relé.
 *   5. Botón mírame (GPIO4): al pulsar → POST /api/v1/devices/identify.
 *   6. Heartbeat cada 30s.
 *
 * Hardware:
 *   - ESP32-S3-USB-OTG (Board: ESP32-S3-USB-OTG / USB Mode: USB-OTG)
 *   - Lector QR 2D USB conectado al puerto USB-Host
 *   - Relé SONGLE SRD-12VDC-SL-C en GPIO16 (ACTIVE-LOW tri-state; ver RELAY_ACTIVE_LOW)
 *   - Pulsador N.O. en GPIO4 (a GND, con INPUT_PULLUP)
 *
 * LÓGICA DEL RELÉ (verificada con test-relay-open-5s.ino):
 *   relayOn()  = OUTPUT + LOW  → relé ON → abierto
 *   relayOff() = INPUT (FLOAT) → relé OFF → cerrado (HIGH haría zumbar el relé)
 *
 * Alimentación del módulo relé: VCC a 12V (SRD-12VDC), GND común con el ESP32.
 *
 * Librerías necesarias (PlatformIO / Arduino Library Manager):
 *   - EspUsbHost (tanakamasayuki)
 *   - WiFiManager  (tzapu)         https://github.com/tzapu/WiFiManager
 *   - Preferences  (incluida en ESP32 Arduino core)
 *
 * Placa:  Board: ESP32-S3-USB-OTG / USB Mode: USB-OTG / Upload Mode: UART0
 */

#include "EspUsbHost.h"
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <WiFiManager.h>
#include "esp_task_wdt.h"  // Fase 1: watchdog timer
#include "esp_system.h"

#define CERRADURAS_API_CA_PEM \
  "-----BEGIN CERTIFICATE-----\n" \
  "MIIFazCCA1OgAwIBAgIRAIIQz7DSQONZRGPgu2OCiwAwDQYJKoZIhvcNAQELBQAw\n" \
  "TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh\n" \
  "cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMTUwNjA0MTEwNDM4\n" \
  "WhcNMzUwNjA0MTEwNDM4WjBPMQswCQYDVQQGEwJVUzEpMCcGA1UEChMgSW50ZXJu\n" \
  "ZXQgU2VjdXJpdHkgUmVzZWFyY2ggR3JvdXAxFTATBgNVBAMTDElTUkcgUm9vdCBY\n" \
  "MTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAK3oJHP0FDfzm54rVygc\n" \
  "h77ct984kIxuPOZXoHj3dcKi/vVqbvYATyjb3miGbESTtrFj/RQSa78f0uoxmyF+\n" \
  "0TM8ukj13Xnfs7j/EvEhmkvBioZxaUpmZmyPfjxwv60pIgbz5MDmgK7iS4+3mX6U\n" \
  "A5/TR5d8mUgjU+g4rk8Kb4Mu0UlXjIB0ttov0DiNewNwIRt18jA8+o+u3dpjq+sW\n" \
  "T8KOEUt+zwvo/7V3LvSye0rgTBIlDHCNAymg4VMk7BPZ7hm/ELNKjD+Jo2FR3qyH\n" \
  "B5T0Y3HsLuJvW5iB4YlcNHlsdu87kGJ55tukmi8mxdAQ4Q7e2RCOFvu396j3x+UC\n" \
  "B5iPNgiV5+I3lg02dZ77DnKxHZu8A/lJBdiB3QW0KtZB6awBdpUKD9jf1b0SHzUv\n" \
  "KBds0pjBqAlkd25HN7rOrFleaJ1/ctaJxQZBKT5ZPt0m9STJEadao0xAH0ahmbWn\n" \
  "OlFuhjuefXKnEgV4We0+UXgVCwOPjdAvBbI+e0ocS3MFEvzG6uBQE3xDk3SzynTn\n" \
  "jh8BCNAw1FtxNrQHusEwMFxIt4I7mKZ9YIqioymCzLq9gwQbooMDQaHWBfEbwrbw\n" \
  "qHyGO0aoSCqI3Haadr8faqU9GY/rOPNk3sgrDQoo//fb4hVC1CLQJ13hef4Y53CI\n" \
  "rU7m2Ys6xt0nUW7/vGT1M0NPAgMBAAGjQjBAMA4GA1UdDwEB/wQEAwIBBjAPBgNV\n" \
  "HRMBAf8EBTADAQH/MB0GA1UdDgQWBBR5tFnme7bl5AFzgAiIyBpY9umbbjANBgkq\n" \
  "hkiG9w0BAQsFAAOCAgEAVR9YqbyyqFDQDLHYGmkgJykIrGF1XIpu+ILlaS/V9lZL\n" \
  "ubhzEFnTIZd+50xx+7LSYK05qAvqFyFWhfFQDlnrzuBZ6brJFe+GnY+EgPbk6ZGQ\n" \
  "3BebYhtF8GaV0nxvwuo77x/Py9auJ/GpsMiu/X1+mvoiBOv/2X/qkSsisRcOj/KK\n" \
  "NFtY2PwByVS5uCbMiogziUwthDyC3+6WVwW6LLv3xLfHTjuCvjHIInNzktHCgKQ5\n" \
  "ORAzI4JMPJ+GslWYHb4phowim57iaztXOoJwTdwJx4nLCgdNbOhdjsnvzqvHu7Ur\n" \
  "TkXWStAmzOVyyghqpZXjFaH3pO3JLF+l+/+sKAIuvtd7u+Nxe5AW0wdeRlN8NwdC\n" \
  "jNPElpzVmbUq4JUagEiuTDkHzsxHpFKVK7q4+63SM1N95R1NbdWhscdCb+ZAJzVc\n" \
  "oyi3B43njTOQ5yOf+1CceWxG1bQVs5ZufpsMljq4Ui0/1lvh+wjChP4kqKOJ2qxq\n" \
  "4RgqsahDYVvTH9w7jXbyLeiNdd8XM2w9U/t7y0Ff/9yi0GE44Za4rF2LN9d11TPA\n" \
  "mRGunUHBcnWEvgJBQl9nJEiU0Zsnvgc/ubhPgXRR4Xq37Z0j4r7g1SgEEzwxA57d\n" \
  "emyPxgcYxn/eR44/KJ4EBs+lVDR3veyJm+kXQ99b21/+jh5Xos1AnX5iItreGCc=\n" \
  "-----END CERTIFICATE-----\n"

#ifndef CERRADURAS_API_CA_PEM
#error "Define CERRADURAS_API_CA_PEM with the deployed API CA/certificate before building"
#endif

// ── Configuración de la API (hardcodeada, no depende de WiFi) ───────────────
const char* API_BASE_URL = "https://cerraduras.josue.ink";

// ── Relay ──────────────────────────────────────────────────────────────────
// Relé recuperado (SONGLE SRD-12VDC-SL-C sobre módulo ACTIVE-LOW): LOW = ON y
// reposo FLOAT (INPUT). El nivel HIGH deja la entrada en zona indeterminada y
// hace zumbar el relé, por eso NUNCA se usa como reposo.
// Poner RELAY_ACTIVE_LOW a 0 para el módulo ACTIVE-HIGH (idle LOW).
#define RELAY_ACTIVE_LOW  1
#define RELAY_PIN         16    // GPIO16 (probado con test-relay-open-5s.ino)
#define OPEN_DURATION_MS  3000   // 3 segundos de pulso de apertura
#define RELAY_CLICK_MS    150    // pulso corto para feedback acústico (no abre)

// FIX #1: longitud mínima de un token QR válido. El token real ronda los 150
// chars; 80 evita descartar lecturas parciales leves (que ahora llegan a la API
// y quedan auditadas como 403) sin aceptar basura corta.
#define QR_MIN_LEN        80
#define LOCK_CHECK_US     5000   // F33: pulso de test de cerradura (5ms, no activa solenoide)

// ── LED feedback ───────────────────────────────────────────────────────────
#define LED_PIN           2     // built-in LED (GPIO2 en la mayoria de placas)
#define LED_ON_MS         4500  // tiempo encendido al conectar WiFi

