josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto.ino
// ── Identify button ("mírame") ─────────────────────────────────────────────
#define IDENTIFY_PIN          4     // GPIO4, pulsador N.O. a GND
#define IDENTIFY_DEBOUNCE_MS  50    // antirrebote

// ── Fase 39: anuncio de inventario de fábrica ───────────────────────────────
// El backend conserva el estado autoritativo; estos valores solo viven en RAM.
#define FACTORY_ANNOUNCE_RETRY_MS   30000UL
#define FACTORY_ANNOUNCE_TIMEOUT_MS 1000

// ── Globales ──────────────────────────────────────────────────────────────
EspUsbHost usb;
String     scanned;
String     pendingQr;
bool       hasPending = false;
unsigned long lastBeat = 0;
bool       scannerConnected = false;  // F33: set true on USB connect, false on disconnect
// F33: el callback USB corre en la tarea del host USB. NUNCA debe usar el
// WiFiClientSecure/HTTPClient compartidos (panic por uso concurrente). El
// heartbeat de SCANNER se pide aquí y lo envía loop() de forma secuencial.
volatile bool scannerBeatPending = false;

// FIX #1: telemetría de rechazos QR diferida. El callback USB NUNCA debe usar
// WiFiClientSecure/HTTPClient (panic por uso concurrente); marca el flag y
// loop() envía la telemetría con el cliente TLS compartido.
volatile bool qrRejectPending = false;
volatile int  qrRejectLen     = 0;
volatile int  qrRejectDots    = 0;
String        qrRejectText;

// ── Fase 1: Non-blocking relay state ──
unsigned long relayOffAt = 0;
bool          relayPulsing = false;

// ── Fase 1: Non-blocking LED + WiFi watchdog state ──
unsigned long ledOffAt = 0;
unsigned long wifiDownSince = 0;

// ── Fase 39: scheduler de anuncio integrado (efímero por arranque) ─────────
bool          factoryAnnouncementEnabled = true;
bool          factoryAnnouncementInFlight = false;
unsigned long factoryNextAttemptAt = 0;
String        deviceFactoryKey;

WiFiClientSecure &apiTlsClient() {
  static WiFiClientSecure client;
  static bool configured = false;
  if (!configured) {
    client.setCACert(CERRADURAS_API_CA_PEM);
    configured = true;
  }
  return client;
}

void beginApiRequest(HTTPClient &http, const String &url) {
  http.begin(apiTlsClient(), url);
}

// Identify button state
bool       lastIdentifyState = HIGH;
bool       identifyPending   = false;
bool       pendingState      = false;
unsigned long identifyDebounce  = 0;
unsigned long lastIdentifyPrint = 0;

// ── chipId: eFuse MAC en hex (sin ':', lowercase) ─────────────────────────
String chipId() {
  uint64_t mac = ESP.getEfuseMac();
  char buf[13];
  snprintf(buf, sizeof(buf), "%02x%02x%02x%02x%02x%02x",
           (uint8_t)(mac >> 40), (uint8_t)(mac >> 32), (uint8_t)(mac >> 24),
           (uint8_t)(mac >> 16), (uint8_t)(mac >> 8),  (uint8_t)(mac));
  return String(buf);
}

String loadOrCreateFactoryKey() {
  Preferences prefs;
  prefs.begin("device-cred", false);
  String key = prefs.getString("factory_key", "");
  if (key.length() == 0) {
    uint8_t randomBytes[24];
    for (size_t i = 0; i < sizeof(randomBytes); i += 4) {
      uint32_t value = esp_random();
      memcpy(randomBytes + i, &value, (sizeof(randomBytes) - i) < 4 ? (sizeof(randomBytes) - i) : 4);
    }
    char encoded[49];
    for (size_t i = 0; i < sizeof(randomBytes); ++i) snprintf(encoded + (i * 2), 3, "%02x", randomBytes[i]);
    encoded[48] = '\0';
    key = String(encoded);
    prefs.putString("factory_key", key);
    Serial.println("[CRED] Credencial individual generada y guardada en NVS device-cred");
  }
  prefs.end();
  return key;
}

void factoryResetProvisioning() {
  Preferences prefs;
  prefs.begin("cerraduras", false);
  prefs.remove("ssid");
  prefs.remove("pass");
  prefs.remove("last_ssid");
  prefs.remove("build_marker");
  prefs.end();
  Serial.println("[FACTORY-RESET] WiFi reiniciado; credencial individual conservada y portal reabierto");
}

void addDeviceAuth(HTTPClient &http) {
  if (deviceFactoryKey.length() > 0) http.addHeader("X-API-Key", deviceFactoryKey);
}

// ── Fase 39: anunciar identidad eFuse sin afectar la operación productiva ──
void announceFactoryDevice(unsigned long now) {
  if (!factoryAnnouncementEnabled || factoryAnnouncementInFlight ||
      WiFi.status() != WL_CONNECTED || now < factoryNextAttemptAt) {
    return;
  }

  factoryAnnouncementInFlight = true;
  factoryNextAttemptAt = now + FACTORY_ANNOUNCE_RETRY_MS;

  String body;
  body.reserve(140);
  body = "{\"chip_id\":\"" + chipId() + "\",\"factory_key\":\"" + deviceFactoryKey + "\"}";

  HTTPClient http;
  beginApiRequest(http, String(API_BASE_URL) + "/api/v1/factory-devices/announce");
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(FACTORY_ANNOUNCE_TIMEOUT_MS);

  unsigned long startedAt = millis();
  int code = http.POST(body);
  String response = http.getString();
  http.end();
  factoryAnnouncementInFlight = false;

  if (code >= 200 && code < 300 && response.indexOf("\"status\":\"CLAIMED\"") >= 0) {
    factoryAnnouncementEnabled = false;
    Serial.printf("[FACTORY] chip_id=%s CLAIMED (%lu ms); anuncios pausados hasta reinicio\n",
                  chipId().c_str(), millis() - startedAt);
  } else if (code >= 200 && code < 300 && response.indexOf("\"status\":\"PENDING\"") >= 0) {
    Serial.printf("[FACTORY] chip_id=%s PENDING (%lu ms); reintento en %lu ms\n",
                  chipId().c_str(), millis() - startedAt, FACTORY_ANNOUNCE_RETRY_MS);
  } else if (code >= 400 && code < 500 && code != 429) {
    // Credencial rechazada (p.ej. 403 invalid_factory_credential) o petición inválida:
    // es terminal para este arranque. Parar el bucle de reintento cada 30 s hasta
    // re-enrolar la placa o reiniciarla; un PENDING genuino nunca cae aquí.
    factoryAnnouncementEnabled = false;
    Serial.printf("[FACTORY] credencial rechazada (HTTP %d); anuncio detenido hasta re-enrolar/reiniciar\n", code);
  } else {
    Serial.printf("[FACTORY] anuncio HTTP %d (%lu ms); reintento en %lu ms\n",
                  code, millis() - startedAt, FACTORY_ANNOUNCE_RETRY_MS);
  }
}

// ── Feedback acústico: pulso corto de relé (clic audible, no abre) ──────────
// Variante no-bootclick: función conservada por compatibilidad, pero ya NO se
// invoca (ni en arranque ni en QR rechazado). El relé solo se acciona con
// relayPulse() (apertura real) o checkLock() (verificación manual).
void relayClick() {
  relayOn();
  delay(RELAY_CLICK_MS);
  relayOff();
}

