josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto.ino
  WiFi.disconnect();
  delay(500);
  WiFi.begin(ssid.c_str(), pass.c_str());
  for (int i = 0; i < 20 && WiFi.status() != WL_CONNECTED; i++) delay(500);
  return WiFi.status() == WL_CONNECTED;
}

// ── Sincronizar reloj vía NTP (OBLIGATORIO para TLS) ─────────────────────
// WiFiClientSecure valida la ventana de validez del certificado contra el
// reloj local. Sin hora (1970) mbedTLS rechaza el cert como "not yet valid"
// y TODAS las llamadas HTTPS fallan (health, heartbeat, announce,
// qr/validate, command-result). Se sincroniza una vez tras conectar WiFi.
void syncSystemTime() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[TIME] Sin WiFi — no se puede sincronizar la hora");
    return;
  }
  configTime(0, 0, "pool.ntp.org", "time.google.com", "time.nist.gov");
  Serial.print("[TIME] Sincronizando hora vía NTP");
  time_t now = time(nullptr);
  int tries = 0;
  while (now < 1700000000 && tries < 20) {   // umbral > Nov 2023; hasta ~20s
    delay(1000);
    now = time(nullptr);
    tries++;
    Serial.print(".");
  }
  Serial.println();
  if (now < 1700000000) {
    Serial.println("[TIME] ⚠ NTP no respondió — el TLS HTTPS fallará (reloj incorrecto)");
  } else {
    struct tm tmi;
    gmtime_r(&now, &tmi);
    Serial.printf("[TIME] OK: %04d-%02d-%02d %02d:%02d:%02d UTC\n",
                  1900 + tmi.tm_year, tmi.tm_mon + 1, tmi.tm_mday,
                  tmi.tm_hour, tmi.tm_min, tmi.tm_sec);
  }
}

// ── Identify: notificar estado del botón a la API ─────────────────────────
void sendIdentify(bool state) {
  if (!ensureWiFi()) {
    Serial.println("[IDENTIFY] Sin WiFi — no se puede enviar");
    return;
  }
  String id   = chipId();
  String body;
  body.reserve(200);  // Fase 1: pre-allocate to prevent heap fragmentation
  body = "{\"external_id\":\"" + id + "\",\"state\":" + (state ? "true" : "false") + "}";
  HTTPClient http;
  beginApiRequest(http, String(API_BASE_URL) + "/api/v1/devices/identify");
  http.addHeader("Content-Type", "application/json");
  addDeviceAuth(http);
  http.setTimeout(1500);
  int code = http.POST(body);
  String resp = http.getString();
  http.end();
  Serial.printf("[IDENTIFY] state=%s → HTTP %d %s\n", state ? "true" : "false", code, resp.c_str());

  if (code == 200) {
    HTTPClient hb;
    beginApiRequest(hb, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
    hb.addHeader("Content-Type", "application/json");
    addDeviceAuth(hb);
    hb.setTimeout(2000);
    hb.POST("{\"external_id\":\"" + id + "\",\"sub_kind\":\"RPI\"}");
    hb.end();
  }
}

// ── FIX #1: telemetría de lecturas QR rechazadas por el pre-filtro ────────
// Sin monitor serie, una lectura parcial USB-HID que el firmware descarta es
// invisible: la API nunca recibe la petición. Enviamos len/dots/hex para poder
// diagnosticar desde el servidor si fue truncamiento, puntos extra o basura.
void reportQrRejected(int qrLen, int qrDots, const String &text) {
  if (!ensureWiFi()) return;

  char buf[4];
  String hexHead;
  hexHead.reserve(220);
  int headLen = text.length() < 60 ? text.length() : 60;
  for (int i = 0; i < headLen; i++) {
    snprintf(buf, sizeof(buf), "%02X ", (uint8_t) text[i]);
    hexHead += buf;
  }
  String hexTail;
  if (text.length() > 60) {
    hexTail.reserve(80);
    for (int i = text.length() - 20; i < (int) text.length(); i++) {
      snprintf(buf, sizeof(buf), "%02X ", (uint8_t) text[i]);
      hexTail += buf;
    }
  }

  String id = chipId();
  String body;
  body.reserve(500);
  body = "{\"external_id\":\"" + id + "\",\"len\":" + String(qrLen) +
         ",\"dots\":" + String(qrDots) +
         ",\"hex_head\":\"" + hexHead + "\",\"hex_tail\":\"" + hexTail + "\"}";

  HTTPClient http;
  beginApiRequest(http, String(API_BASE_URL) + "/api/v1/devices/qr-rejected");
  http.addHeader("Content-Type", "application/json");
  addDeviceAuth(http);
  http.setTimeout(2500);
  int code = http.POST(body);
  http.getString();
  http.end();
  Serial.printf("[QR] telemetría rechazo → HTTP %d (len=%d dots=%d)\n", code, qrLen, qrDots);
}

// ── setup ─────────────────────────────────────────────────────────────────
void setup() {
  // Relé OFF desde el PRIMER instante del sketch. Antes se hacía tras
  // Serial.begin+delay(3000): en esos ~3 s GPIO16 quedaba sin control y, con la
  // cerradura (solenoide) conectada a la fuente real, podía dispararse en el
  // arranque → brownout → reinicio en bucle sin llegar nunca al AP/heartbeat.
  relayOff();

  Serial.begin(115200);
  delay(3000);
  deviceFactoryKey = loadOrCreateFactoryKey();

  pinMode(IDENTIFY_PIN, INPUT_PULLUP);
  lastIdentifyState = digitalRead(IDENTIFY_PIN);
  if (lastIdentifyState == LOW) {
    Serial.println("[FACTORY-RESET] Botón mantenido durante arranque: esperando liberación...");
    factoryResetProvisioning();
    while (digitalRead(IDENTIFY_PIN) == LOW) delay(20);
    delay(250);
    ESP.restart();
  }

  String id = chipId();
  Serial.println("\n==============================================");
  Serial.println(" ESP32-S3 QR Reader + Relay 12V (v6-12v — ACTIVE-LOW tri-state)");
  Serial.println(" Device ID: " + id);
  Serial.println(" Relay pin: GPIO" + String(RELAY_PIN) + " (ACTIVE-LOW tri-state, SRD-12VDC)");
  Serial.println("==============================================");
  Serial.println("");
  Serial.println("  🔧 PRIMER INICIO: si no hay WiFi guardada,");
  Serial.println("     este dispositivo creara la red:");
  Serial.println("     >> Cerraduras-Setup-" + id + " <<");
  Serial.println("");
  Serial.println("  🏷️  PEGATINA: Cerraduras-Setup-" + id);
  Serial.println("");

  scanned.reserve(512);
  pendingQr.reserve(512);

  // ── WiFi: wipe NVS si firmware nuevo → NVS → connect → WiFiManager ───
  clearNvsIfNewFirmware();    // si versión != stored → wipe NVS + restart
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);

  // Fase 1: TWDT con timeout 60s (RF-1.1). loopTask NO se vigila hasta el 1er
  // loop(), por lo que el provisioning largo en setup() (WiFiManager, hasta 5 min)
  // ya es seguro sin pausar ni borrar la suscripción. No usar
  // esp_task_wdt_delete(NULL): loopTask aún no está suscrito aquí y generaría un
  // `task_wdt: delete_entry: task not found` benigno en cada arranque.
  //
  // API del watchdog según core: Arduino-ESP32 core 3.x (IDF 5.x) cambió la firma
  // de esp_task_wdt_init() a un config-struct. Guard para mantener compilable el
  // sketch también en core 2.x (IDF 4.x), donde la firma era (timeout_sec, panic).
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms     = 60000,   // RF-1.1: 60s
      .idle_core_mask = 0,       // no vigilar idle tasks (igual que hoy)
      .trigger_panic  = true,    // panic/reinicio al expirar
  };
  esp_task_wdt_init(&wdt_cfg);
#else
  esp_task_wdt_init(60, true);   // Arduino core 2.x (IDF 4.x)
#endif

  bool nvsConnected = connectWithNvs();

