josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto.ino
              // Report results
              String resultBody;
              resultBody.reserve(350);  // Fase 1: pre-allocate
              resultBody = "{\"command_id\":" + String(cmdId) +
                                   ",\"external_id\":\"" + chipId() + "\"" +
                                   ",\"results\":{" +
                                   "\"RPI\":true," +
                                   "\"SCANNER\":" + String(scannerOk ? "true" : "false") + "," +
                                   "\"LOCK\":" + String(lockOk ? "true" : "false") +
                                   "}}";

              HTTPClient cmdResult;
              beginApiRequest(cmdResult, String(API_BASE_URL) + "/dashboard-api/command-result");
              cmdResult.addHeader("Content-Type", "application/json");
              addDeviceAuth(cmdResult);
              cmdResult.setTimeout(3000);
              int resCode = cmdResult.POST(resultBody);
              String resResp = cmdResult.getString();
              cmdResult.end();
              esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
              yield();
              Serial.printf("[F33] Command result POST → HTTP %d %s\n", resCode, resResp.c_str());
            } else {
              Serial.printf("[F33] Unknown command: %s — skipping\n", cmdName.c_str());
            }
          } else {
            Serial.println("[F33] No command data in response");
          }
        } else {
          Serial.printf("[F33] Poll failed (HTTP %d)\n", cmdCode);
        }
      }
    }
  }

  // ── Identify button ─────────────────────────────────────────────────
  bool raw = digitalRead(IDENTIFY_PIN);
  if (raw != lastIdentifyState) {
    if (now - identifyDebounce > IDENTIFY_DEBOUNCE_MS) {
      lastIdentifyState = raw;
      identifyPending   = true;
      pendingState      = (raw == LOW);
      Serial.printf("\n[IDENTIFY] flanco → state=%s\n", pendingState ? "true (pulsado)" : "false (suelto)");
    }
    identifyDebounce = now;
  }

  if (lastIdentifyState == LOW && now - lastIdentifyPrint > 500) {
    lastIdentifyPrint = now;
    Serial.printf("[IDENTIFY] PULSANDO... (%s)\n", chipId().c_str());
  }

  if (identifyPending) {
    identifyPending = false;
    sendIdentify(pendingState);
  }

  // ── Fase 1: Relé no bloqueante ──
  if (relayPulsing && millis() > relayOffAt) {
    relayOff();
    relayPulsing = false;
    Serial.println("[RELAY] → OFF (pestillo cerrado)");
  }

  // ── Fase 1: LED feedback no bloqueante ──
  if (ledOffAt && millis() > ledOffAt) {
    digitalWrite(LED_PIN, LOW);
    ledOffAt = 0;
    Serial.println("[OK] LED apagado");
  }

  // ── Fase 1: WiFi watchdog — reinicio si >2 min sin conexión ──
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiDownSince == 0) {
      wifiDownSince = millis();
      Serial.println("[WIFI] Conexión perdida — contador 120s para reinicio");
    } else if (millis() - wifiDownSince > 120000) {
      Serial.println("[WIFI] 120s sin conexión — ESP.restart()");
      delay(500);
      ESP.restart();
    }
  } else {
    wifiDownSince = 0;
  }

  // ── Fase 39: inventario auxiliar, después de QR/USB/heartbeat/identify ──
  // HTTPClient usa el timeout corto mínimo disponible; no hay delay ni bucle de espera.
  esp_task_wdt_reset();  // defensa: feed antes del posible HTTP de announce
  announceFactoryDevice(now);
  esp_task_wdt_reset();  // defensa: feed tras el posible HTTP de announce
  yield();
}
